nyu-scps-200610-Java1-x25.9269/session4/demo4/client/request.env

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Header/>
	<SOAP-ENV:Body>
		<m:getStockQuote SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:m="http://www.quote.nyu.edu">
			<m:StockSymbol xsi:type="xsd:string">MMC</m:StockSymbol>
		</m:getStockQuote>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
